zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_spgss.h
/*****************************************************************************

  Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

/**
 * @file hw_spgss.h
 * @brief SPGSS (串行外设组子系统) 硬件寄存器定义
 *
 * 本文件定义了 MSPM0G3507 微控制器中 SPGSS 模块的全部寄存器和位域。
 * SPGSS 提供串行外设的系统级控制功能，主要特性包括：
 * - I2C 多主/SMBus 配对支持
 * - SPG 实例间回环（Loopback）功能
 * - DMA 链式传输配置
 * - CPU 中断控制
 */

#ifndef ti_devices_msp_peripherals_hw_spgss__include
#define ti_devices_msp_peripherals_hw_spgss__include

/* Filename: hw_spgss.h */
/* Revised: 2024-07-09 09:23:19 */
/* Revision: 3060da33b0a30a38b851efb52ec3edd92cebbf75 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* SPGSS Registers - SPGSS 寄存器定义
******************************************************************************/

/* 各寄存器组基地址偏移 */
#define SPGSS_I2C_PAIR_OFS                       ((uint32_t)0x000011C0U)  /* I2C配对寄存器偏移 */
#define SPGSS_UNICOMM_LPBK_OFS                   ((uint32_t)0x00001120U)  /* 回环寄存器偏移 */
#define SPGSS_DMA_CHAIN_OFS                      ((uint32_t)0x00001100U)  /* DMA链式寄存器偏移 */
#define SPGSS_DMA_CHAIN1_OFS                     ((uint32_t)0x00001080U)  /* DMA链1寄存器偏移 */
#define SPGSS_DMA_CHAIN0_OFS                     ((uint32_t)0x00001050U)  /* DMA链0寄存器偏移 */
#define SPGSS_CPU_INT_OFS                        ((uint32_t)0x00001020U)  /* CPU中断寄存器偏移 */


/** @addtogroup SPGSS_I2C_PAIR
  @{
*/

/* I2C 配对寄存器组（用于多主/SMBus应用） */
typedef struct {
  __IO uint32_t PAIR0;                             /* !< (@ 0x000011C0) I2C配对0 */
  __IO uint32_t PAIR1;                             /* !< (@ 0x000011C4) I2C配对1 */
  __IO uint32_t PAIR2;                             /* !< (@ 0x000011C8) I2C配对2 */
  __IO uint32_t PAIR3;                             /* !< (@ 0x000011CC) I2C配对3 */
  __IO uint32_t PAIR4;                             /* !< (@ 0x000011D0) I2C配对4 */
  __IO uint32_t PAIR5;                             /* !< (@ 0x000011D4) I2C配对5 */
  __IO uint32_t PAIR6;                             /* !< (@ 0x000011D8) I2C配对6 */
  __IO uint32_t PAIR7;                             /* !< (@ 0x000011DC) I2C配对7 */
} SPGSS_I2C_PAIR_Regs;

/*@}*/ /* end of group SPGSS_I2C_PAIR */

/** @addtogroup SPGSS_UNICOMM_LPBK
  @{
*/

/* 回环（Loopback）寄存器组 - 用于SPG实例间回环测试 */
typedef struct {
  __IO uint32_t LPBK0;                             /* !< (@ 0x00001120) 回环配置0（需确保回环的SPG使用相同IP） */
  __IO uint32_t LPBK1;                             /* !< (@ 0x00001124) 回环配置1（需确保回环的SPG使用相同IP） */
} SPGSS_UNICOMM_LPBK_Regs;

/*@}*/ /* end of group SPGSS_UNICOMM_LPBK */

/** @addtogroup SPGSS_DMA_CHAIN
  @{
*/

/* DMA 链式传输寄存器组 */
typedef struct {
  __IO uint32_t DMACHAIN0;                         /* !< (@ 0x00001100) DMA链0选择（选择SPG FIFO） */
  __IO uint32_t DMACHAIN1;                         /* !< (@ 0x00001104) DMA链1选择（选择SPG FIFO） */
} SPGSS_DMA_CHAIN_Regs;

/*@}*/ /* end of group SPGSS_DMA_CHAIN */

/** @addtogroup SPGSS_DMA_CHAIN1
  @{
*/

/* DMA 链1 中断寄存器组 */
typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00001088) 中断屏蔽寄存器 */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001090) 原始中断状态 */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001098) 屏蔽后中断状态 */
       uint32_t RESERVED3[3];
  __O  uint32_t ICLR;                              /* !< (@ 0x000010A8) 中断清除寄存器 */
} SPGSS_DMA_CHAIN1_Regs;

/*@}*/ /* end of group SPGSS_DMA_CHAIN1 */

/** @addtogroup SPGSS_DMA_CHAIN0
  @{
*/

/* DMA 链0 中断寄存器组 */
typedef struct {
       uint32_t RESERVED0[2];
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) 中断屏蔽寄存器 */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) 原始中断状态 */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) 屏蔽后中断状态 */
       uint32_t RESERVED3[3];
  __O  uint32_t ICLR;                              /* !< (@ 0x00001078) 中断清除寄存器 */
} SPGSS_DMA_CHAIN0_Regs;

